In [1]:
from wrangle import wrangle_telco
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from datetime import date
import seaborn as sns
from pydataset import data
from env import host, user, password

In [2]:
telco = wrangle_telco()

In [3]:
telco.head()

  customer_id  monthly_charges  tenure  total_charges
0  0002-ORFBO            65.60       9         593.30
1  0020-JDNXP            61.25      34        1993.20
2  0022-TCJCI            62.70      45        2791.50
3  0023-UYUPN            25.20      50        1306.30
4  0036-IHMOT           103.70      55        5656.75

In [4]:
# telco.total_charges = telco.replace(r'^\s*$', np.NaN, regex = True)

In [5]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1473 entries, 0 to 1472
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1473 non-null   object
 1   monthly_charges  1473 non-null   float64
 2   tenure           1473 non-null   int64
 3   total_charges    1473 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 46.2+ KB

In [6]:
telco

     customer_id  monthly_charges  tenure  total_charges
0     0002-ORFBO            65.60       9         593.30
1     0020-JDNXP            61.25      34        1993.20
2     0022-TCJCI            62.70      45        2791.50
3     0023-UYUPN            25.20      50        1306.30
4     0036-IHMOT           103.70      55        5656.75
...          ...              ...     ...            ...
1468  9968-FFVVH            68.80      63        4111.35
1469  9972-VAFJJ            94.00      53        4871.45
1470  9978-HYCIN            84.95      47        4018.05
1471  9979-RGMZT            94.05       7         633.45
1472  9987-LUTYD            55.15      13         742.90

[1473 rows x 4 columns]